stm32-hotspot/STM32WB-Filter-Accept-List-Peripheral/WB55_whitelist/STM32_WPAN/App/app_ble.c
/*************************************************************
 *
 * SPECIFIC FUNCTIONS FOR CUSTOM
 *
 *************************************************************/
static void Adv_Cancel(void)
{
  /* USER CODE BEGIN Adv_Cancel_1 */

  /* USER CODE END Adv_Cancel_1 */

  if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

    ret = aci_gap_set_non_discoverable();

    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("** STOP ADVERTISING **  Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("  \r\n\r");
      APP_DBG_MSG("** STOP ADVERTISING **  \r\n\r");
    }
  }

  /* USER CODE BEGIN Adv_Cancel_2 */

  /* USER CODE END Adv_Cancel_2 */

  return;
}

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle)
{
  /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

  /* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */

  if (mutex == 1)
  {
    mutex = 0;
    index_con_int = (index_con_int + 1)%SIZE_TAB_CONN_INT;
    uint16_t interval_min = CONN_P(a_ConnInterval[index_con_int]);
    uint16_t interval_max = CONN_P(a_ConnInterval[index_con_int]);
    uint16_t peripheral_latency = L2CAP_PERIPHERAL_LATENCY;
    uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
    tBleStatus ret;

    ret = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                    interval_min, interval_max,
                                                    peripheral_latency, timeout_multiplier);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
    }
  }

  /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

  /* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */

  return;
}
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void Connection_Interval_Update_Req(void)
{
  if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }

  return;
}
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */
static void ble_clear_db(void)
{
  tBleStatus ret;
  
  ret = aci_gap_set_non_discoverable(); // STOP advertising if advertising
  APP_DBG_MSG("aci_gap_set_non_discoverable() : 0x%02X\t%s\t\n",
              ret,
              ret == BLE_STATUS_SUCCESS ? "successfully stopped advertising" : "was not advertising");
  
  ret = aci_gap_clear_security_db();
  APP_DBG_MSG("aci_gap_clear_security_db() : 0x%02X\tto clear the bonding table - all bonded devices are removed\r\n", ret);
  if(ret != BLE_STATUS_SUCCESS)
  {
    Error_Handler();
  }
  
  adv_start();
}
/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* p_Data)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);

  return;
}

void hci_cmd_resp_release(uint32_t Flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

void hci_cmd_resp_wait(uint32_t Timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

static void BLE_UserEvtRx(void *p_Payload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *p_param;

  p_param = (tHCI_UserEvtRxParam *)p_Payload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(p_param->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    p_param->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    p_param->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t Status)
{
  uint32_t task_id_list;
  switch (Status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdBusy */

      /* USER CODE END HCI_TL_CmdBusy */
      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdAvailable */

      /* USER CODE END HCI_TL_CmdAvailable */
      break;

    default:
      /* USER CODE BEGIN Status */

      /* USER CODE END Status */
      break;
  }

  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();

  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
static int8_t ble_count_bonded_devices(void)
{
  uint8_t total = 0;
  Bonded_Device_Entry_t devices[16];
  List_Entry_t device_accept[16];
  
  tBleStatus ret = aci_gap_configure_filter_accept_list();
  APP_DBG_MSG("\taci_gap_configure_filter_accept_list() status = 0x%02X\r\n", ret);
  
  ret = aci_gap_get_bonded_devices(&total, devices);
  if(BLE_STATUS_SUCCESS == ret)
  {
    if(total == 0)
    {
      APP_DBG_MSG("No previous bonded devices\r\n");
    }
    else
    {
      for(uint8_t k = 0; k < total; k++)
      {
        APP_DBG_MSG("Bonded device %d / %d - %s BLE address %02X:%02X:%02X:%02X:%02X:%02X\r\n",
                    k, total,
                    devices[k].Address_Type == 0 ? "Public" : "Random",
                    devices[k].Address[5], devices[k].Address[4], devices[k].Address[3],
                    devices[k].Address[2], devices[k].Address[1], devices[k].Address[0]);
        device_accept[k].Address_Type = devices[k].Address_Type;
        device_accept[k].Address[5] = devices[k].Address[5];
        device_accept[k].Address[4] = devices[k].Address[4];
        device_accept[k].Address[3] = devices[k].Address[3];
        device_accept[k].Address[2] = devices[k].Address[2];
        device_accept[k].Address[1] = devices[k].Address[1];
        device_accept[k].Address[0] = devices[k].Address[0];
        
        // Append to both resolving list and Filter Accept List
        ret = aci_gap_add_devices_to_list(1, &device_accept[k], 0x04);
        APP_DBG_MSG("aci_gap_add_devices_to_list() status = 0x%02X\r\n", ret);
      }
    }
  }
  else
  {
    APP_DBG_MSG("ACI_GAP_GET_BONDED_DEVICES error %x\r\n", ret);
    total = -1;
  }
  return total;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
